
using System;

// В първия списък е списък с работниците в малка фирма за кроасани. Някои работят от години , други от скоро.
// Счетоводителя се е сменил и като е прехвърлял данните от старата система е записал някои от имената по 2 пъти.

List<string> employees = new List<string>
{
    "Georgiev", "Makrelov", "Jivkov", "Petrov", "Markov", "Petrov", "Ivailov", "Iliev", "Jivkov", "Jivkov", "Mitrev",
    "Georgiev", "Mileva" , "Kakanakov"
};

// Втория списък е с дните отпуска по азбучен ред , но отзад на пред, които се падат на всеки работник. Така си ги е записал стария счетоводител
// , като пак е допуснал някои повторения.

List<int> freeDays = new List<int> { 5, 2, 9 , 6 ,8,19,19,19, 27, 86 ,76,22 };

// Хората искат да им се побликува списъка с отпуската. Принтирайте го като за начало в конзолата.

// Подсказка :
// * Филтрираме двата масива да съдържат само уникални стойности
// * Сортираме масива с имена обратно на азбучния ред ( първо може да го сортирате азбучно и после да го обърнете )
// * Принтирате за всеки елемент от първия масив съответния елемент от втория ( за всяко име - дните отпуска )